
//组 634941583
String 脚本名称="潮汐";

String LIN= "潮汐Java 适用 菜豆(QT)"
           +"临江踏雨不返(2376738596)"
           +"友 秩河(2799026792)";

if("是".equals(getString("初次使用","是否完成")))
{
toast(脚本名称+ "Java\n开始加载 \n许你一个美好的明天，愿世间的每一个角落都洒满璀璨的星光。");
}



String 路径 = appPath + "/潮汐目录/";

public void 加载文件(String a)
{
load(路径 + a );
}

加载文件("夏花/花云.java");
加载文件("夏花/梦如.java");
加载文件("夏花/问云.java");
加载文件("夏花/夏云.java");
加载文件("夏花/朝年.java");
加载文件("夏花/云舞.java");
加载文件("夏花/始雨.java");
加载文件("朝云/若年.java");
加载文件("朝云/远雨.java");
加载文件("朝云/阅景.java");
加载文件("朝云/琴音.java");
加载文件("朝云/终云.java");
加载文件("朝云/葬花.java");
加载文件("朝云/若知.java");
加载文件("朝云/舞花.java");
加载文件("云府/山海.java");
加载文件("云府/知云.java");
加载文件("云府/语音点歌.java");
加载文件("云府/api/接口.java");
加载文件("云府/api/Apis/pay.java");

if("是".equals(getString("初次使用","是否完成")))
{
    提示("潮汐Java \n加载完成\n流星雨如水顷，月明还伴落日余辉，萤虫飞舞似群星");
}
//此版本于22年11月20日更新

//非正统写法 没有技术含量 仅供QQ娱乐

//喜欢胜过所有道理 原则抵不过你乐意.
