public void 雾花(Object 汐)
{
if(故("更新内容")||故("更新日志"))
{
更新内容();
}


if(故("关闭所有群")||故("关机所有群"))
{
全弃(开关机);
语("所有开机的群已关闭");
}
if(故("查看已开启群")||故("查看已开机的群")||故("查看已开启的群"))
{

String 落=群组名(简取(开关机));
String 落秋=论(落,"]","");
String 落秋华=论(落秋,"["," ");
//String 落秋云花=论(落秋华,", ","\n");
语("当前已开启的群:\n"+落秋华 );
}
if(故("开机")||故("开"))
{
if(!汐.远景)
{
提示("脚本暂时不支持在非群聊使用");
}
if(南("1027783860")||南("441269033")||南("97498672")||南("11315139"))
{
语("脚本不支持在本群开启,请前往别的群开启");//强行修改在以上群开机禁言30天或全局拉黑 不解释
return;
}
if(简读开关(开关机))
{
回("当前群聊已开启");
return;
}
else{
  简写(开关机,汐.群);
String 开机=

     "              "+"潮汐"+"\n"
    +"———开机成功———\n"
    +"名称:"+汐.源+"\n"
    +"用户:"+myUin+"\n"
    +"群聊:"+朝云(汐.群)+"\n"
    +"群号:"+汐.群+"\n"
    +"———————————";

String 开机2=
"◇━━━  潮汐  ━━━◇\n"+
"———开机成功————\n"+
 "名称:"+汐.源+"\n"
    +"用户:"+myUin+"\n"
    +"群聊:"+朝云(汐.群)+"\n"
    +"群号:"+汐.群+"\n"+
"———————————"+
"\n"+
"◇━━━━━━━━━◇";      

String 开机3="<?xml version='1.0' encoding='UTF-8' standalone='yes' ?><msg serviceID=\"35\" templateID=\"75\" action=\"web\" brief=\"开机特效\" sourceMsgId=\"0\" url=\"\" flag=\"0\" adverSign=\"0\" multiMsgFlag=\"0\"><item layout=\"1\" action=\"web\" advertiser_id=\"0\" aid=\"0\"><picture cover=\""+随()+"\" w=\"5\" h=\"5\" /><summary size=\"40\" color=\""+scolor()+"\" style=\""+n()+"\">潮汐Java</summary><summary size=\"35\" color=\""+scolor()+"\" style=\""+n()+"\">———开机成功———</summary><summary size=\"35\" color=\""+scolor()+"\" style=\""+n()+"\">名称:"+汐.源+"</summary><summary size=\"35\" color=\""+scolor()+"\" style=\""+n()+"\">用户:"+myUin+"</summary><summary size=\"35\" color=\""+scolor()+"\" style=\""+n()+"\">群聊:"+朝云(汐.群)+"</summary><summary size=\"35\" color=\""+scolor()+"\" style=\""+n()+"\" >群号:"+汐.群+"</summary><summary size=\"35\" color=\""+scolor()+"\" style=\""+n()+"\" >———————————</summary></item><source name=\"\" icon=\"\" action=\"-1\" appid=\"-1\" /></msg>";

if(等("3",读("样式","菜单样式"))||等("4",读("样式","菜单样式"))||等("5",读("样式","菜单样式")))
{纸(开机3);return;}
if(等("2",读("样式","菜单样式")))
{语(开机2);return;}
语(开机);
    }
}

if(故("关机")||故("关"))
{
if(简读开关(开关机))
{
简弃(开关机,汐.群);
String 关机=
     "              "+"潮汐"+"\n"
    +"———关机成功———\n"
    +"名称:"+汐.源+"\n"
    +"用户:"+myUin+"\n"
    +"群聊:"+朝云(汐.群)+"\n"
    +"群号:"+汐.群+"\n"
    +"———————————";
String 关机2=
"◇━━━  潮汐  ━━━◇\n"+
"———关机成功————\n"+
 "名称:"+汐.源+"\n"
    +"用户:"+myUin+"\n"
    +"群聊:"+朝云(汐.群)+"\n"
    +"群号:"+汐.群+"\n"+
"———————————"+
"\n"+
"◇━━━━━━━━━◇";      

String 关机3="<?xml version='1.0' encoding='UTF-8' standalone='yes' ?><msg serviceID=\"35\" templateID=\"75\" action=\"web\" brief=\"\" sourceMsgId=\"0\" url=\"\" flag=\"0\" adverSign=\"0\" multiMsgFlag=\"0\"><item layout=\"1\" action=\"web\" advertiser_id=\"0\" aid=\"0\"><picture cover=\""+随()+"\" w=\"5\" h=\"5\" /><summary size=\"40\" color=\""+scolor()+"\" style=\""+n()+"\">潮汐Java</summary><summary size=\"35\" color=\""+scolor()+"\" style=\""+n()+"\">———关机成功———</summary><summary size=\"35\" color=\""+scolor()+"\" style=\""+n()+"\">名称:"+汐.源+"</summary><summary size=\"35\" color=\""+scolor()+"\" style=\""+n()+"\">用户:"+myUin+"</summary><summary size=\"35\" color=\""+scolor()+"\" style=\""+n()+"\">群聊:"+朝云(汐.群)+"</summary><summary size=\"35\" color=\""+scolor()+"\" style=\""+n()+"\" >群号:"+汐.群+"</summary><summary size=\"35\" color=\""+scolor()+"\" style=\""+n()+"\" >———————————</summary></item><source name=\"\" icon=\"\" action=\"-1\" appid=\"-1\" /></msg>";

if(等("3",读("样式","菜单样式"))||等("4",读("样式","菜单样式"))||等("5",读("样式","菜单样式")))
{纸(关机3);return;}
if(等("2",读("样式","菜单样式")))
{语(关机2);return;}
语(关机);
}
else{
提示("都没开 你想人家怎么开嘛!");}
}


if(简读开关(开关机))
{
if(故始("关闭菜单")&&故里(8))
{
if(简读开关(菜单开关))
{
提示("都没开呢，你关个啥");
return;
}
else
简写(菜单开关,汐.群);
语("本群菜单已关闭");
}
if(故始("开启菜单")&&故里(8))
{
if(简读开关(菜单开关))
{
简弃(菜单开关,汐.群);
语("本群菜单已开启");
}
else
提示("本群菜单已开启，无需重复开启");
}

if(故("关闭菜单限制"))
{
if(简读开关(菜单限制))
{
简弃(菜单限制,汐.群);
语("本群菜单限制已关闭");
return;
}
else
回("本群菜单限制未开启");
}

if(故("开启菜单限制"))
{
if(简读开关(菜单限制))
{
回("本群菜单限制状态为开");
return;
}
else
简写(菜单限制,汐.群);
语("本群菜单限制已开启");
}

if(故("切换菜单样式1"))
{
存("样式","菜单样式",null);
回("菜单样式已切换为1(普通)");
}
if(故("切换菜单样式2"))
{
存("样式","菜单样式","2");
回("菜单样式已切换为2(正方)");
}
if(故("切换菜单样式3"))
{
存("样式","菜单样式","3");
回("菜单样式已切换为3(卡片1 应该仅自己可见哟)\n-继承卡片制作菜单java");
}
if(故("切换菜单样式4"))
{
存("样式","菜单样式","4");
回("菜单样式已切换为4(卡片2 应该仅自己可见哟)");
}

if(故("切换菜单样式5"))
{
存("样式","菜单样式","5");
回("菜单样式已切换为5(卡片3 应该仅自己可见哟)");
}




if(故("关闭一言")||故("关闭文案")||故("关闭文案功能"))
{
if(简读开关(一言))
{
语("本群的文案已关闭，无需重复关闭");
return;
}
else
简写(一言,汐.群);
语("本群的文案功能已关闭");
}

if(故("开启一言")||故("开启文案")||故始("开启文案功能"))
{
if(简读开关(一言))
{
简弃(一言,汐.群);
语("本群的文案功能已开启");
return;
}
else
语("文案功能已开启无需重复开启");
}


if(故始("关闭查询"))
{
if(简读开关(查询功能))
{
语("本群的查询功能已关闭，关闭状态下仅代管与自己可用");
return;
}
else
简写(查询功能,汐.群);
语("本群的查询功能已关闭成功");
}
if(故始("开启查询"))
{
if(简读开关(查询功能))
{
简弃(查询功能,汐.群);
语("本群的查询功能已开启");
return;
}
else
语("本群的查询功能是开启状态");
}
if(故("开启代管抢劫"))
{
if(读开关("开","代管抢劫"))
{
回("代管抢劫状态为开");
return;
}
else{
存(汐.群,"代管抢劫","开");
回("代管抢劫已开启成功,代管发起抢劫成功后自动分红");
}
}
if(故("关闭代管抢劫"))
{
if(读开关("开","代管抢劫"))
{
存(汐.群,"代管抢劫","关");
回("代管抢劫已关闭 抢劫时不会再进行分红");
return;
}
else
{
回("当前状态为关");
}
}



if(故("开启勿扰模式"))
{
if(读开关("开","勿扰模式"))
{
回("艾特禁言状态为开");
return;
}
else
存(汐.群,"勿扰模式","开");
语("勿扰模式开启成功，艾特时自动禁言");
}

if(故("关闭勿扰模式"))
{
if(读开关("开","勿扰模式"))
{
存(汐.群,"勿扰模式",null);
语("本群的勿扰模式已关闭");
return;
}
else
回("尚未打开勿扰模式");
}







if(故始("关闭图片")&&故里(8))
{
if(简读开关(图片开关))
{
提示("本群图片功能已关闭，无需重复关闭");
return;
}
else
简写(图片开关,汐.群);
语("本群图片功能已关闭");
}
if(故始("开启图片")&&故里(8))
{
if(简读开关(图片开关))
{
简弃(图片开关,汐.群);
语("本群图片功能已打开");
return;}
else
提示("本群图片功能已开启，无需重复开启");
}

if(故始("关闭管理")||故始("关闭群管")||故始("关闭操作"))
{
if(简读开关(管理操作))
{
提示("都没开你关个啥");
return;}
else
简写(管理操作,汐.群);
语("本群管理操作提示已关闭");
}
if(故("开启点歌")||故("开启语音点歌"))
{
if(读关开("QQ点歌"))
{
回("本群语音点歌状态为开");
return;
}
else
存(汐.群,"QQ点歌",null);
语("本群语音点歌已打开成功");
return;
}

if(故("关闭点歌")||故("关闭语音点歌"))
{
if(读开关("1","QQ点歌"))
{
回("本群语音点歌状态为关");
return;
}
else
存(汐.群,"QQ点歌","1");
语("本群语音点歌已关闭");
return;
}



if(故始("开启管理")||故始("开启群管")||故始("开启操作"))
{
if(简读开关(管理操作))
{
简弃(管理操作,汐.群);
语("本群管理操作提示已开启");
return;
}
else
提示("开着呢");
}
if(故("开启隐藏艾特"))
{
if(读开关("开","隐藏艾特"))
{
语("隐藏艾特已经打开了，无需重复打开");
return;
}
else
存(汐.群,"临时保险","开");
语("开启隐藏艾特后，为了防止某些误操作，群管功能将被禁用，你是否同意开启,同意请发 \n［确认开启］");
}
if(读开关("开","临时保险"))
{
if(故("确认开启"))
{
语("隐藏艾特已开启 你可以发送 内容+@ 来体验此功能");
缓冲(50);
语("潮汐:已禁用群管功能");
存(汐.群,"隐藏艾特","开");
缓冲(100);
存(汐.群,"临时保险",null);
}
}

if(故("关闭隐藏艾特"))
{
存(汐.群,"隐藏艾特","关");
语("已关闭隐藏艾特，群管功能恢复正常");
}


if(故始("关闭色色限制")||故始("关闭涩涩限制"))
{
if(读开关("开","涩涩限制"))
{
语("本群的涩涩限制已关闭，无需重复关闭");
return;
}
else
存(汐.群,"涩涩限制","开");
语("本群的涩涩限制已解除 大家可以尽情观看图片功能里面的东西啦！");
}

if(故始("开启色色限制")||故始("开启涩涩限制"))
{
if(读开关("开","涩涩限制"))
{
存(汐.群,"涩涩限制","关");
语("主人开启涩涩限制 你们这堆笨蛋别想看了！");
}
else{
语("本群的涩涩限制已经打开过了");}
}

if(故("爱腾讯"))
{
for(int i=0;i<3;i++)
{
语("爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活");
}
}


if(故("#爱腾讯"))
{
new Thread(new Runnable(){
                    public void run()
                    {
for(int i=0;i<50;i++)
{
sendMsg("835395029","","爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活爱腾讯爱生活");
                            try
                            {
                                Thread.sleep(3000);
                            }
                            catch (InterruptedException e)
                            {}
                            }
                                                }
                }).start();
}

//龙王火花标识
if(故("开启群互动标识")||故("开启群聊互动标识")||故("开启本群互动标识")||故("开启互动标识"))
{
String hdbs=SetTroopShowHonour(汐.群,myUin,getSkey(),getPskey("clt.qq.com"),1);
if(hdbs.equals("设置成功"))
{
语("本群的群互动标识已开启,龙王与群聊热火功能已开启");return;
}
else
语(SetTroopShowHonour(汐.群,myUin,getSkey(),getPskey("clt.qq.com"),1));
}
if(故("关闭群互动标识")||故("关闭群聊互动标识")||故("关闭本群互动标识")||故("关闭互动标识"))
{
String hdbs=SetTroopShowHonour(汐.群,myUin,getSkey(),getPskey("clt.qq.com"),0);
if(hdbs.equals("设置成功"))
{
语("本群的群互动标识已关闭,龙王与群聊热火功能已不可见");return;
}
else
语(SetTroopShowHonour(汐.群,myUin,getSkey(),getPskey("clt.qq.com"),0));
}
//等级
if(故("开启群聊等级显示")||故("开启本群等级显示")||故("开启等级显示"))
{
String djxs=SetTroopShowLevel(汐.群,myUin,getSkey(),getPskey("clt.qq.com"),1);
if(djxs.equals("设置成功"))
{
语("已开启本群的个人群聊等级显示");
return;
}
else
语(SetTroopShowLevel(汐.群,myUin,getSkey(),getPskey("clt.qq.com"),1));
}

if(故("关闭群聊等级显示")||故("关闭本群等级显示")||故("关闭等级显示"))
{
String djxs=SetTroopShowLevel(汐.群,myUin,getSkey(),getPskey("clt.qq.com"),0);
if(等(djxs,"设置成功"))
{
语("已关闭本群的个人群聊等级显示");
return;
}
else
语(SetTroopShowLevel(汐.群,myUin,getSkey(),getPskey("clt.qq.com"),0));
}
//头衔
if(故("开启群聊头衔显示")||故("开启本群头衔显示")||故("开启头衔显示"))
{
String txxs=SetTroopShowTitle(汐.群,myUin,getSkey(),getPskey("clt.qq.com"),1);
if(等(txxs,"设置成功"))
{
语("本群的群员头衔显示已开启");
return;
}
else
语(SetTroopShowTitle(汐.群,myUin,getSkey(),getPskey("clt.qq.com"),1));
}

if(故("关闭群聊头衔显示")||故("关闭本群头衔显示")||故("关闭头衔显示"))
{
String txxs=SetTroopShowTitle(汐.群,myUin,getSkey(),getPskey("clt.qq.com"),0);
if(等(txxs,"设置成功"))
{
语("本群的群员头衔显示已关闭");
return;
}
else
语(SetTroopShowTitle(汐.群,myUin,getSkey(),getPskey("clt.qq.com"),0));
}

}
}

